export const websites = [
  {
    title: 'Soyle.kz',
    undertitle: 'Онлайн платформа',
    content: `
        Soyle.kz – қазақ тілін жаңадан бастап үйренушілерге арналған тегін онлайн курс. Мұнда интерактивті сабақтар, видео материалдар, грамматикалық жаттығулар және сөйлеу тәжірибесін дамытуға көмектесетін тапсырмалар бар.`,
    link: 'https://soyle.kz',
  },
  {
    title: 'Tilqural.kz',
    undertitle: 'Онлайн платформа',
    content: `
       Tilqural – қазақ тілін меңгерудің әртүрлі деңгейлеріне арналған интерактивті оқу платформасы. Ол Қазтест жүйесіне негізделген тапсырмалар ұсынады және қолданушылардың тілдік дағдыларын бағалауға мүмкіндік береді.      
    `,

    link: 'https://tilqural.kz/',
  },
  {
    title: 'Bala.soyle.kz',
    undertitle: 'Онлайн платформа',
    content: `
       Bala.soyle.kz – мектеп жасындағы балалар мен бастауыш деңгейдегі оқушыларға арналған қазақ тілі курсы. Мұнда қызықты анимациялар, интерактивті жаттығулар және ойын элементтері арқылы тіл үйренуге болады.    `,

    link: 'https://bala.soyle.kz/',
  },
  {
    title: 'Sozdik.kz',
    undertitle: 'Онлайн платформа',
    content: `
Sozdik.kz – қазақ тілінің ең үлкен онлайн сөздігі. Ол қазақ-орыс, орыс-қазақ, сондай-ақ ағылшын, түрік және басқа тілдерге аударма жасауға мүмкіндік береді. Сонымен қатар, грамматика және синонимдер бойынша қосымша ақпарат береді.
    `,

    link: 'https://sozdik.kz/',
  },
];
